In [ ]:
import pandas as pd

### read_csv()

read_csv()를 이용하여 csv 파일을 편리하게 DataFrame으로 로딩합니다.

read_csv()의 sep 인자를 콤마(,)가 아닌 다른 분리자로 변경하여 다른 유형의 파일도 로드가 가능합니다.

In [ ]:
titanic_df = pd.read_csv('titanic/train.csv')
print('titanic 변수 type:', type(titanic_df))

### head()

DataFrame의 맨 앞 일부 데이터만 추출합니다.

In [ ]:
titanic_df.head()

### DataFrame의 생성

In [ ]:
dic1 = {
    'Name' : ['Chulmin', 'Eunkyung', 'Jinwoong', 'Soobeom'],
    'Year' : [2011, 2016, 2015, 2015],
    'Gender' : ['Male', 'Female', 'Male', 'Male']
}
# 딕셔너리를 DataFrame으로 변환
data_df = pd.DataFrame(dic1)
print(data_df)
print("#"*30)

# 새로운 컬럼명을 추가
data_df = pd.DataFrame(dic1, columns=["Name", "Year", "Gender", "Age"])
print(data_df)
print("#"*30)

# 인덱스를 새로운 값으로 할당
data_df = pd.DataFrame(dic1, index=['one', 'two', 'three', 'four'])
print(data_df)
print("#"*30)

### DataFrame의 컬럼명과 인덱스

In [ ]:
print("columns:", titanic_df.columns)
print("index:", titanic_df.index)
print("index values:", titanic_df.index.values)

### DataFrame에서 Series 추출 및 DataFrame 필터링 추출
Series : 컬럼이 한 개 있는 1차원 데이터셋

In [ ]:
# DataFrame객체에서 []연ㅅ나자내에 한개의 컬럼만 입력하면 Series 객체를 반환
series = titanic_df['Name']
print(series.head(3))
print("## type:", type(series))

# DataFrame객체에서 []연산자내에 여러개의 컬럼을 리스트로 입력하면 그 컬럼들로 구성된 DataFrame 반환
f_df = titanic_df[['Name', 'Age']]
print(f_df.head(3))
print("## type:", type(f_df))

# DataFrame객체에서 []연삱자내에 한개의 컬럼을 리스트로 입력하면 한개의 컬럼으로 구성된 DataFrame 반환
one_df = titanic_df[['Name']]
print(one_df.head(3))
print("## type:", type(one_df))

### shape
DataFrame의 행과 열크기를 가지고 있는 속성

In [ ]:
print('DataFrame 크기: ', titanic_df.shape)

### info()
DataFrame내의 컬럼명, 데이터 타입, Null건수, 데이터 건수 정보를 제공

In [ ]:
titanic_df.info()

### describe()
데이터값들의 평균, 표준편차, 4분위 분포도를 제공합니다. 숫자형 컬럼들에 대해서 해당 정보를 제공합니다.

In [ ]:
titanic_df.describe()

### value_counts()
동일한 개별 데이터 값이 몇건이 있는지 정보를 제공합닏. 즉 개별 데이터값의 분포도를 제공합니다. 주의할 점은 value_count()는 Series객체에서만 호출될 수 있으므로 반드시 DataFrame을 단일 컬럼으로 입력하여 Series로 변환한 뒤 호출합니다.

In [ ]:
v_counts = titanic_df['Pclass'].value_counts()
print(v_counts)

In [ ]:
t_pclass = titanic_df['Pclass']
print(type(t_pclass))

### sort_values() by=정렬컬럼, ascending=True or False 오름차순/내림차순 정렬

In [23]:
titanic_df.sort_values(by='Pclass', ascending=False) # default False
# titanic_df.sort_values(by='Pclass')
# titanic_df[['Name','Age', 'Pclass']].sort_values(by=['Pclass', 'Age'])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
511,512,0,3,"Webber, Mr. James",male,NaN,0,0,SOTON/OQ 3101316,8.0500,NaN,S
500,501,0,3,"Calic, Mr. Petar",male,17.0,0,0,315086,8.6625,NaN,S
501,502,0,3,"Canavan, Miss. Mary",female,21.0,0,0,364846,7.7500,NaN,Q
502,503,0,3,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,330909,7.6292,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
102,103,0,1,"White, Mr. Richard Frasar",male,21.0,0,1,35281,77.2875,D26,S
710,711,1,1,"Mayne, Mlle. Berthe Antonine (""Mrs de Villiers"")",female,24.0,0,0,PC 17482,49.5042,C90,C
711,712,0,1,"Klaber, Mr. Herman",male,NaN,0,0,113028,26.5500,C124,S
712,713,1,1,"Taylor, Mr. Elmer Zebley",male,48.0,1,0,19996,52.0000,C126,S
445,446,1,1,"Dodge, Master. Washington",male,4.0,0,2,33638,81.8583,A34,S